// equalityRoleConfig.js
// تعیین می‌کند چه نقش‌هایی سمت "company" در نظر گرفته شوند و چه نقش‌هایی سمت "user".
export const EQUALITY_ROLES = {
  // اگر کاربر هرکدام از این نقش‌ها را داشته باشد، سمت شرکت محسوب می‌شود
  companySide: ["بانک", "خزانه", "همکار", "معامله گر"],

  // اگر در نقش‌های بالا نبود ولی یکی از این نقش‌ها را داشت، سمت کاربران است
  userSide: ["مشتري", "سود"],

  // اگر نقشی خارج از این داشت یا خواستید نقشی را کامل کنار بگذارید:
  exclude: ["استخر"],
  // یا می‌توانید نقش‌هایی که واقعاً در محاسبات نقشی ندارند را exclude کنید
};
